bit-finance/Catalogs/бит_НастройкиФормВводаБюджета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_НастройкиФормВводаБюджета</Name>
			<Comment>(БИТ)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<BasedOn>
				<xr:Item>Catalog.бит_Бюджеты</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыНастроекФормВводаБюджета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиПостроителя</Name>
					<Comment>Хранит настройки построителя отчета для заполнения форм ввода бюджетов</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстЗапроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Учет_Количество</Name>
					<Comment>Учет по количеству</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Учет_Сумма</Name>
					<Comment>Учет по сумме</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бюджет</Name>
					<Comment>Бюджет</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Бюджеты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьНаименованияСтатейБюджета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьОбщиеИтоги</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъединятьЯчейки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьКоэффициентыСтатейБюджета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаПланирования</Name>
					<Comment>Начало интервала планирования</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияПланирования</Name>
					<Comment>Дата окончания планирования</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеДерева</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьЦвет_Группа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьЦвет_Ячейка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьЦвет_Формула</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьЦвет_Аргумент</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодичностьПланирования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ПериодичностьПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПродолжительностьИнтервала</Name>
					<Comment>Продолжительность интервала планирования (количество периодов планирования)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрНорм</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыПроизвольныхПараметров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗащищатьФормулы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимОтображенияВыходныхДней</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_РежимыОтображенияВыходныхДнейФормыВвода</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РедакцияНастроек</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияПодсистемыБФ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьКодификатор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Версия_2</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасположениеПолейГруппировок</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_РасположениеПолейГруппировок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МакетОформления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьЦветГруппы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьЦветЯчейки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьЦветФормулы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьЦветАргумента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветаОформления</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеСпискаСмежности</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВАрхиве</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Измерения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособЗаполнения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бит_СпособыЗаполненияИзмеренийВФормахВвода</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПоУмолчанию</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяТипаПоУмолчанию</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеИтоги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Периодичность</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бит_ПериодичностьПланирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НарастающийИтог</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Формулы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяЯчейки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Формула</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

bit-finance/Enums/бит_РасположениеПолейГруппировок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_РасположениеПолейГруппировок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Вместе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отдельно</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

bit-finance/Enums/бит_ВидыНастроекФормВводаБюджета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_ВидыНастроекФормВводаБюджета</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Динамическая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФиксированныйМакет</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

bit-finance/Enums/бит_СпособыЗаполненияИзмеренийВФормахВвода.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_СпособыЗаполненияИзмеренийВФормахВвода</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоУмолчанию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоУмолчаниюРедактирование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Разворачивать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РазворачиватьСИерархией</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РучнойВвод</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

bit-finance/Enums/бит_РежимыОтображенияВыходныхДнейФормыВвода.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_РежимыОтображенияВыходныхДнейФормыВвода</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Обычный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выделять</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеОтображать</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

bit-finance/Catalogs/бит_НастройкиФормВводаБюджета/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки	 - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#КонецОбласти

#Область СлужебныйпрограммныйИнтерфейс

#Область ОбработчикиОбновленияИБ

Процедура УстановитьВыводитьКодификаторПриПереходеНаНовуюВерсию() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_НастройкиФормВводаБюджета.Ссылка КАК Ссылка,
	|	бит_НастройкиФормВводаБюджета.ВерсияПодсистемыБФ КАК ВерсияПодсистемыБФ,
	|	бит_НастройкиФормВводаБюджета.ВыводитьКодификатор КАК ВыводитьКодификатор
	|ИЗ
	|	Справочник.бит_НастройкиФормВводаБюджета КАК бит_НастройкиФормВводаБюджета
	|ГДЕ
	|	НЕ бит_НастройкиФормВводаБюджета.ЭтоГруппа
	|	И НЕ бит_НастройкиФормВводаБюджета.ВыводитьКодификатор";
				   
	Результат = Запрос.Выполнить();
	Выборка   = Результат.Выбрать();  
	
	// ++ ЕРП 
	МладшаяВерсияПодсистемыБФ = "3.2.42.1";
	СтаршаяВерсияПодсистемыБФ = "3.2.42.4";
	// -- ЕРП
	
	Пока Выборка.Следующий() Цикл  
		Если ОбщегоНазначенияКлиентСервер.СравнитьВерсии(Выборка.ВерсияПодсистемыБФ, МладшаяВерсияПодсистемыБФ) > 0 Тогда
			Продолжить;		
		КонецЕсли;     
		
		ТекущийОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ТекущийОбъект.ВыводитьКодификатор = Истина; 
		ТекущийОбъект.ВерсияПодсистемыБФ  = СтаршаяВерсияПодсистемыБФ;
		
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(ТекущийОбъект);
	КонецЦикла;	

КонецПроцедуры

Процедура ЗаполнитьОформлениеПриПереходеНаНовуюВерсию(Параметры) Экспорт
	
	МетаданныеОбъекта	 = ПустаяСсылка().Метаданные();
	ПолноеИмяОбъекта  	 = МетаданныеОбъекта.ПолноеИмя();
	ПредставлениеОбъекта = МетаданныеОбъекта.Представление();
	ИмяПроцедуры	  	 = "ЗаполнитьОформлениеПриПереходеНаНовуюВерсию";
		
	ОбъектовОбработано = 0;
	ПроблемныхОбъектов = 0; 
	
	ОбновляемыеДанные = ОбновлениеИнформационнойБазы.ДанныеДляОбновленияВМногопоточномОбработчике(Параметры);
	
	Для Каждого СтрокаТаблицы Из ОбновляемыеДанные Цикл
		ПредставлениеСсылки = Строка(СтрокаТаблицы.Ссылка);		
		
		НачатьТранзакцию();
		
		Попытка
			
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить(ПолноеИмяОбъекта);
			ЭлементБлокировки.УстановитьЗначение("Ссылка", СтрокаТаблицы.Ссылка);
			Блокировка.Заблокировать();
			
			СправочникОбъект = СтрокаТаблицы.Ссылка.ПолучитьОбъект(); 
			
			Если СправочникОбъект = Неопределено Тогда
				ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(СтрокаТаблицы.Ссылка);
				ОбъектовОбработано = ОбъектовОбработано + 1;
				ЗафиксироватьТранзакцию();
				Продолжить;
			КонецЕсли;
			
			Если СправочникОбъект.РасположениеПолейГруппировок = Перечисления.бит_РасположениеПолейГруппировок.ПустаяСсылка() Тогда
				
				СправочникОбъект.МакетОформления 		  	  = бит_ОтчетыБФСервер.ИмяОсновногоМакетаОформленияОтчета();
				СправочникОбъект.ИспользоватьЦветГруппы   	  = Истина;
				СправочникОбъект.ИспользоватьЦветЯчейки   	  = Истина;
				СправочникОбъект.ИспользоватьЦветФормулы  	  = Истина;
				СправочникОбъект.ИспользоватьЦветАргумента	  = Истина;
				СправочникОбъект.РасположениеПолейГруппировок = Перечисления.бит_РасположениеПолейГруппировок.Отдельно;
				
				НастройкиОформления = НовыеЦветаОформления();
				
				СправочникОбъект.ЦветаОформления = Новый ХранилищеЗначения(НастройкиОформления, Новый СжатиеДанных(9));
			КонецЕсли;
			
			Если СправочникОбъект.Вид = Перечисления.бит_ВидыНастроекФормВводаБюджета.ФиксированныйМакет Тогда
				ДокументРезультат = СправочникОбъект.ХранилищеДерева.Получить();
				
				СписокСмежности   = бит_БюджетированиеКлиентСервер.СписокСмежности(ДокументРезультат);
				СправочникОбъект.ХранилищеСпискаСмежности = Новый ХранилищеЗначения(СписокСмежности, Новый СжатиеДанных(9));
				
				// Дополнение расшифровки.
				Для каждого Область Из ДокументРезультат.Области Цикл
					Если ТипЗнч(Область.Расшифровка) <> Тип("Структура") Тогда
						Продолжить;		
					КонецЕсли;	
					
					ИмяКласса = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Область.Расшифровка, "ИмяКласса", "");
					Если ИмяКласса <> "РасшифровкаЯчейкиФормыВвода" Тогда
						Продолжить;		
					КонецЕсли;
					
					ИдентификаторРасшифровки = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Область.Расшифровка, "ИдентификаторРасшифровки", "");
					ОбработатьРасшифровку 	 = ПустаяСтрока(ИдентификаторРасшифровки);
					
					Если НЕ ОбработатьРасшифровку Тогда
						Продолжить;		
					КонецЕсли;
					
					СмежныеОбласти = Новый Структура;
					СмежныеОбласти.Вставить("СП", "");
					СмежныеОбласти.Вставить("КП", "");
					СмежныеОбласти.Вставить("СФ", "");
					СмежныеОбласти.Вставить("КФ", "");		
					
					ЧастиИмени = СтрРазделить(Область.Расшифровка.Имя, "_");
					Если ЧастиИмени.Количество() > 2 Тогда
						Префикс = ЧастиИмени[0];
						// Если префикс подойдет к одному из ключей структуры, значит это наша область.
						Если СмежныеОбласти.Свойство(Префикс) Тогда
							СмежныеОбласти[Префикс] = Область.Расшифровка.Имя;
							Для каждого КлючЗначение Из СмежныеОбласти Цикл
								Если КлючЗначение.Ключ = Префикс Тогда
									Продолжить;					
								КонецЕсли;
								ЧастиИмени[0] 	= КлючЗначение.Ключ;
								ИмяКандидата	= СтрСоединить(ЧастиИмени, "_");
								РезультатПоиска = ДокументРезультат.Области.Найти(ИмяКандидата);
								Если РезультатПоиска <> Неопределено Тогда
									СмежныеОбласти[КлючЗначение.Ключ] = ИмяКандидата;
								КонецЕсли;
							КонецЦикла;
						КонецЕсли;
					КонецЕсли;

					Область.Расшифровка.Вставить("СмежныеОбласти", 			 СмежныеОбласти);
					Область.Расшифровка.Вставить("ИдентификаторРасшифровки", Область.Расшифровка.Имя);
					Область.Расшифровка.Вставить("ИдентификаторСтроки", 	 "");
					Область.Расшифровка.Вставить("ЦветФона", 				 Область.ЦветФона);
					
					ЗначенияГруппировок = Новый Массив;
					Если ТипЗнч(Область.Расшифровка.Измерения) = Тип("Структура") Тогда
						Для каждого КлючЗначение Из Область.Расшифровка.Измерения Цикл
							ЗначенияГруппировок.Добавить(КлючЗначение.Значение);
						КонецЦикла;
					Иначе
						ЗначенияГруппировок.Добавить(Область.Расшифровка.Значение);
					КонецЕсли;
					Область.Расшифровка.ИдентификаторСтроки = бит_ВводБюджета.ИдентификаторРасшифровки(ЗначенияГруппировок, Область.Расшифровка.Период);
				КонецЦикла;
				
				СправочникОбъект.ХранилищеДерева = Новый ХранилищеЗначения(ДокументРезультат, Новый СжатиеДанных(9));
			КонецЕсли;
			
			Если СправочникОбъект.Модифицированность() Тогда
				ОбновлениеИнформационнойБазы.ЗаписатьДанные(СправочникОбъект);
			Иначе
				ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(СтрокаТаблицы.Ссылка);
			КонецЕсли;
			
			ОбъектовОбработано = ОбъектовОбработано + 1;
			ЗафиксироватьТранзакцию();
			
		Исключение
			ОтменитьТранзакцию();

			ПроблемныхОбъектов = ПроблемныхОбъектов + 1;
			
			ОбновлениеИнформационнойБазы.ЗаписатьОшибкуВЖурналРегистрации(СтрокаТаблицы.Ссылка, ПредставлениеСсылки, 
				ИнформацияОбОшибке());	
		КонецПопытки;
	КонецЦикла;
	
	Если ОбъектовОбработано = 0 И ПроблемныхОбъектов <> 0 Тогда
		ШаблонСообщения = НСтр("ru = 'Процедуре ""%1"" не удалось обработать некоторые элементы ""%2"" (пропущены): %3'; 
								|en = 'The procedure ""%1"" failed to process some ""%2"" (skipped): %3'");
		ТекстСообщения = СтрШаблон(ШаблонСообщения, ИмяПроцедуры, ПредставлениеОбъекта, ПроблемныхОбъектов);
		ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Информация, МетаданныеОбъекта,, ТекстСообщения);
	Иначе
		ШаблонСообщения = НСтр("ru = 'Обработана очередная порция элементов ""%1"": %2';
								|en = 'The next batch of documents ""%1"" has been processed: %2'");
		ТекстСообщения = СтрШаблон(ШаблонСообщения, ПредставлениеОбъекта, ОбъектовОбработано);
		ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Информация, МетаданныеОбъекта,, ТекстСообщения);
	КонецЕсли;
		
	Параметры.ОбработкаЗавершена = ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(Параметры.Очередь, ПолноеИмяОбъекта);

КонецПроцедуры

Процедура ЗарегистрироватьДанныеКОбработкеОформления(Параметры) Экспорт

	ПараметрыВыборки = Параметры.ПараметрыВыборки;
	ПараметрыВыборки.ПолныеИменаОбъектов = ПустаяСсылка().Метаданные().ПолноеИмя();
	ПараметрыВыборки.СпособВыборки 		 = ОбновлениеИнформационнойБазы.СпособВыборкиСсылки();
	ПараметрыВыборки.ПоляУпорядочиванияПриРаботеПользователей.Добавить("Ссылка УБЫВ");
	ПараметрыВыборки.ПоляУпорядочиванияПриОбработкеДанных.Добавить("Ссылка УБЫВ");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Реквизиты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.бит_НастройкиФормВводаБюджета КАК Реквизиты
	|ГДЕ
	|	Реквизиты.РасположениеПолейГруппировок = ЗНАЧЕНИЕ(Перечисление.бит_РасположениеПолейГруппировок.ПустаяСсылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка УБЫВ";

	ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));

КонецПроцедуры

Процедура ДобавитьОрганизациюВРазрезыПриПереходеНаНовуюВерсию(Параметры) Экспорт

	МетаданныеОбъекта	 = ПустаяСсылка().Метаданные();
	ПолноеИмяОбъекта  	 = МетаданныеОбъекта.ПолноеИмя();
	ПредставлениеОбъекта = МетаданныеОбъекта.Представление();
	ИмяПроцедуры	  	 = "ДобавитьОрганизациюВРазрезыПриПереходеНаНовуюВерсию";
	
	ОбъектовОбработано = 0;
	ПроблемныхОбъектов = 0; 
	
	ОбновляемыеДанные = ОбновлениеИнформационнойБазы.ДанныеДляОбновленияВМногопоточномОбработчике(Параметры);
		
	ОбразецТаблицы = НоваяТаблицаИзмеренийНастройки(Ложь);
	СтрокаОбразец  = ОбразецТаблицы.Найти("Организация", "Имя");
 	СтрокаОбразец.СпособЗаполнения = Перечисления.бит_СпособыЗаполненияИзмеренийВФормахВвода.РучнойВвод;
	ИндексСтрокиОрганизация = ОбразецТаблицы.Индекс(СтрокаОбразец);	

	Для Каждого СтрокаТаблицы Из ОбновляемыеДанные Цикл
		
		ПредставлениеСсылки = Строка(СтрокаТаблицы.Ссылка);	
		
		НачатьТранзакцию();
		Попытка
			
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить(ПолноеИмяОбъекта);
			ЭлементБлокировки.УстановитьЗначение("Ссылка", СтрокаТаблицы.Ссылка);
			Блокировка.Заблокировать();
			
			СправочникОбъект = СтрокаТаблицы.Ссылка.ПолучитьОбъект(); 
			
			Если СправочникОбъект = Неопределено Тогда
				ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(СтрокаТаблицы.Ссылка);
				ОбъектовОбработано = ОбъектовОбработано + 1;
				ЗафиксироватьТранзакцию();
				Продолжить;
			КонецЕсли;
			
			ОбъектИзменен = Ложь;
			
			РезультатПоиска = СправочникОбъект.Измерения.Найти("Организация", "Имя");
			Если РезультатПоиска = Неопределено Тогда
				ЗаполнитьЗначенияСвойств(СправочникОбъект.Измерения.Добавить(), СтрокаОбразец);
				ТекущийИндекс = СправочникОбъект.Измерения.Количество() - 1;
				Если ТекущийИндекс > ИндексСтрокиОрганизация Тогда
					СправочникОбъект.Измерения.Сдвинуть(ТекущийИндекс, - (ТекущийИндекс - ИндексСтрокиОрганизация));
				КонецЕсли;
				ОбъектИзменен = Истина;
			КонецЕсли;
			
			Если ОбъектИзменен Тогда
				ОбновлениеИнформационнойБазы.ЗаписатьДанные(СправочникОбъект);
			Иначе
				ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(СтрокаТаблицы.Ссылка);	
			КонецЕсли;
			
			ОбъектовОбработано = ОбъектовОбработано + 1;			
			ЗафиксироватьТранзакцию();
		Исключение
			
			ОтменитьТранзакцию();
			ПроблемныхОбъектов = ПроблемныхОбъектов + 1;
			
			ОбновлениеИнформационнойБазы.ЗаписатьОшибкуВЖурналРегистрации(СтрокаТаблицы.Ссылка, ПредставлениеСсылки, 
				ИнформацияОбОшибке());		
		КонецПопытки;
	КонецЦикла;

	Если ОбъектовОбработано = 0 И ПроблемныхОбъектов <> 0 Тогда
		ШаблонСообщения = НСтр("ru='Процедуре ""%1"" не удалось обработать некоторые ""%2"" (пропущены): %3';
							  |en='Procedure ""%1"" failed to process some documents ""%2"" (skipped): %3'");
		ТекстСообщения = СтрШаблон(ШаблонСообщения, ИмяПроцедуры, ПредставлениеОбъекта, ПроблемныхОбъектов);
		ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Информация, МетаданныеОбъекта,, ТекстСообщения);
	Иначе
		ШаблонСообщения = НСтр("ru = 'Обработана очередная порция элементов ""%1"": %2';
								|en = 'The next batch of documents ""%1"" has been processed: %2'");
		ТекстСообщения = СтрШаблон(ШаблонСообщения, ПредставлениеОбъекта, ОбъектовОбработано);
		ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Информация, МетаданныеОбъекта,, ТекстСообщения);
	КонецЕсли;
		
	Параметры.ОбработкаЗавершена = ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(Параметры.Очередь, ПолноеИмяОбъекта);

КонецПроцедуры

Процедура ЗарегистрироватьДанныеКДобавлениюОрганизации(Параметры) Экспорт

	ПараметрыВыборки = Параметры.ПараметрыВыборки;
	ПараметрыВыборки.ПолныеИменаОбъектов = ПустаяСсылка().Метаданные().ПолноеИмя();
	ПараметрыВыборки.СпособВыборки 		 = ОбновлениеИнформационнойБазы.СпособВыборкиСсылки();
	ПараметрыВыборки.ПоляУпорядочиванияПриРаботеПользователей.Добавить("Ссылка УБЫВ");
	ПараметрыВыборки.ПоляУпорядочиванияПриОбработкеДанных.Добавить("Ссылка УБЫВ");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Реквизиты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.бит_НастройкиФормВводаБюджета КАК Реквизиты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_НастройкиФормВводаБюджета.Измерения КАК СписокИзмерений
	|		ПО (СписокИзмерений.Ссылка = Реквизиты.Ссылка)
	|			И (СписокИзмерений.Имя = ""Организация"")
	|ГДЕ
	|	СписокИзмерений.НомерСтроки ЕСТЬ NULL
	|	И НЕ Реквизиты.ЭтоГруппа
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка УБЫВ";

	ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));	

КонецПроцедуры

#КонецОбласти

Функция СохраненныеНастройки(НастройкиФормыВвода) Экспорт

	СохраненныеНастройки = Новый Структура("НастройкиКомпоновщика", Новый НастройкиКомпоновкиДанных);
	Реквизит			 = Неопределено;
	
	Если ТипЗнч(НастройкиФормыВвода) = Тип("СправочникОбъект.бит_НастройкиФормВводаБюджета") Тогда
		Реквизит = НастройкиФормыВвода.НастройкиПостроителя;
	ИначеЕсли ЗначениеЗаполнено(НастройкиФормыВвода) Тогда	
		Реквизит = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НастройкиФормыВвода, "НастройкиПостроителя");
	КонецЕсли;
	
	Если ТипЗнч(Реквизит) = Тип("ХранилищеЗначения") Тогда
		ЗначениеРеквизита = Реквизит.Получить();
		Если ТипЗнч(ЗначениеРеквизита) = Тип("Структура") Тогда
			ЗаполнитьЗначенияСвойств(СохраненныеНастройки, ЗначениеРеквизита);
		КонецЕсли;	
	КонецЕсли;
	
	Возврат СохраненныеНастройки;

КонецФункции
   
// Подготавливает настройки измерений формы ввода бюджета 
// по элементу справочника бит_НастройкиФормВводаБюджета.
// 
// Параметры:
//  Настройка - СправочникСсылка.бит_НастройкиФормВводаБюджета.
// 
// Возвращаемое значение:
//  РезСтр - Структура.
// 
Функция ПодготовитьНастройки(Настройка) Экспорт
	
	// Вычисляемые свойства
	СвойстваНастройки = Новый Структура;
	СвойстваНастройки.Вставить("ФиксированныйМакет", 					 Ложь);
	СвойстваНастройки.Вставить("ИмяКласса", 							 "НастройкиИзмеренийФормыВводаБюджета");
	СвойстваНастройки.Вставить("Настройка", 							 Неопределено);
	СвойстваНастройки.Вставить("ИспользоватьНаименованияСтатейБюджета",  Ложь);
	СвойстваНастройки.Вставить("ИспользоватьКоэффициентыСтатейБюджета",  Ложь);
	СвойстваНастройки.Вставить("СпособыЗаполнения", 					 Новый Соответствие);
	СвойстваНастройки.Вставить("Измерения", 							 Новый Структура);
	СвойстваНастройки.Вставить("ДополнительныеИтоги", 					 Новый Массив);
	СвойстваНастройки.Вставить("ВыводитьОбщиеИтоги", 					 Ложь); 
	СвойстваНастройки.Вставить("УчетКоличество", 						 Ложь);
	СвойстваНастройки.Вставить("УчетСумма", 							 Ложь);
	СвойстваНастройки.Вставить("ПараметрНорм", 							 Неопределено);
	СвойстваНастройки.Вставить("ОбъединятьЯчейки", 					 	 Ложь);
	СвойстваНастройки.Вставить("КоличествоРазворачивать", 				 0);
	СвойстваНастройки.Вставить("Периодичность", 						 Неопределено);
	СвойстваНастройки.Вставить("ОтображениеВыходных", 					 Ложь);
	СвойстваНастройки.Вставить("Цвета", 								 Неопределено);
	СвойстваНастройки.Вставить("ИмяРазворачивать", 					 	 "СтатьяОборотов");
	СвойстваНастройки.Вставить("ИспользоватьКоэффициенты", 				 Ложь);
	СвойстваНастройки.Вставить("РасположениеПолейГруппировок",		 	 Перечисления.бит_РасположениеПолейГруппировок.Отдельно);
	
	СвойстваНастройки.Вставить("НастройкаСтруктурыБюджета",		 	 	 Неопределено);
	СвойстваНастройки.Вставить("УникальныйИдентификатор",		 	 	 Новый УникальныйИдентификатор);
	СвойстваНастройки.Вставить("МестоИспользования",		 	 		 "");
	
	ДанныеСправочника = ДанныеСправочника(Настройка);	
	Реквизиты		  = ДанныеСправочника.Реквизиты;
	ТаблицаИзмерения  = ДанныеСправочника.ТаблицаИзмерения;
	ТаблицаДопИтоги   = ДанныеСправочника.ТаблицаДопИтоги;
		
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(СвойстваНастройки, Реквизиты, Истина);
	
	ФиксированныйМакет 		 = (Реквизиты.Вид = Перечисления.бит_ВидыНастроекФормВводаБюджета.ФиксированныйМакет);   
	ИспользоватьКоэффициенты = (ЗначениеЗаполнено(Реквизиты.Бюджет) И Реквизиты.ИспользоватьКоэффициентыСтатейБюджета);
	
	Если ЗначениеЗаполнено(Реквизиты.РежимОтображенияВыходныхДней) Тогда
		ОтображениеВыходных = Реквизиты.РежимОтображенияВыходныхДней; 
	Иначе
		ОтображениеВыходных = Перечисления.бит_РежимыОтображенияВыходныхДнейФормыВвода.Обычный; 
	КонецЕсли;

	ВсеСпособыЗаполнения = Перечисления.бит_СпособыЗаполненияИзмеренийВФормахВвода; 
	
	СпособыЗаполнения = Новый Соответствие;
	СпособыЗаполнения.Вставить(ВсеСпособыЗаполнения.ПоУмолчанию, 			   Новый Массив);
	СпособыЗаполнения.Вставить(ВсеСпособыЗаполнения.ПоУмолчаниюРедактирование, Новый Массив);
	СпособыЗаполнения.Вставить(ВсеСпособыЗаполнения.Разворачивать, 			   Новый Массив);
	СпособыЗаполнения.Вставить(ВсеСпособыЗаполнения.РучнойВвод, 	 		   Новый Массив);
	
	СвойстваНастройки.НастройкаСтруктурыБюджета = НастройкаСтруктурыБюджета(ТаблицаИзмерения);
	
	ИзмеренияПроизвольные = бит_Бюджетирование.НастройкиИзмеренийБюджетирования();	
	Измерения 			  = Новый Структура;
	
	КоличествоРазворачивать = 0;
	
	Для каждого СтрокаТаблицы Из ТаблицаИзмерения Цикл
		
		Если СтрокаТаблицы.СпособЗаполнения = ВсеСпособыЗаполнения.Разворачивать 
		 ИЛИ СтрокаТаблицы.СпособЗаполнения = ВсеСпособыЗаполнения.РазворачиватьСИерархией Тогда
			Ключ 					= ВсеСпособыЗаполнения.Разворачивать;
			КоличествоРазворачивать = КоличествоРазворачивать + 1;
		Иначе	
			Ключ = СтрокаТаблицы.СпособЗаполнения;
		КонецЕсли;
		 
		РезультатПоиска = СпособыЗаполнения.Получить(Ключ);
		РезультатПоиска.Добавить(СтрокаТаблицы.Имя);
				
		ИзмерениеПроизвольное = ИзмеренияПроизвольные[СтрокаТаблицы.Имя];
		Синоним			   = ?(ИзмерениеПроизвольное = Неопределено, "", ИзмерениеПроизвольное.Синоним);
		
		ОписаниеИзмерения = ОписаниеИзмерения(СтрокаТаблицы.Имя, Синоним, СтрокаТаблицы.СпособЗаполнения,
								СтрокаТаблицы.ЗначениеПоУмолчанию);
		Измерения.Вставить(СтрокаТаблицы.Имя, ОписаниеИзмерения);
	КонецЦикла; 
	
	ЦветаОформления = ДанныеСправочника.Реквизиты.ЦветаОформления.Получить();
	Если ЦветаОформления = Неопределено Тогда
		ЦветаОформления = Справочники.бит_НастройкиФормВводаБюджета.НовыеЦветаОформления();
	КонецЕсли;
	
	РазворачитьПо = "СтатьяОборотов";
	Если КоличествоРазворачивать > 0 Тогда
		РазворачитьПо = СпособыЗаполнения[ВсеСпособыЗаполнения.Разворачивать][0];
	КонецЕсли;
	
	СвойстваНастройки.СпособыЗаполнения	   	   = СпособыЗаполнения;
	СвойстваНастройки.Измерения			   	   = Измерения;
	СвойстваНастройки.ДополнительныеИтоги 	   = ОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаДопИтоги);
	СвойстваНастройки.КоличествоРазворачивать  = КоличествоРазворачивать;
	СвойстваНастройки.Цвета 				   = ЦветаОформления;
	СвойстваНастройки.ИмяРазворачивать		   = РазворачитьПо;
    СвойстваНастройки.ФиксированныйМакет 	   = ФиксированныйМакет;
	СвойстваНастройки.УчетКоличество 	  	   = Реквизиты.Учет_Количество;
	СвойстваНастройки.УчетСумма 	  		   = Реквизиты.Учет_Сумма;
    СвойстваНастройки.Периодичность			   = Реквизиты.ПериодичностьПланирования;
	СвойстваНастройки.ОтображениеВыходных	   = ОтображениеВыходных;
	СвойстваНастройки.ИспользоватьКоэффициенты = ИспользоватьКоэффициенты; 
	
	Возврат СвойстваНастройки;
	
КонецФункции

// Процедура инициализирует компоновщик, используемый для фильтрации структуры дерева.
// 
Функция ИнициализироватьКомпоновщик(вхТекстЗапроса, Компоновщик, УникальныйИдентификатор, 
			ЗагрузитьНастройкиПоУмолчанию = Истина, Бюджет = Неопределено) Экспорт
			
	// ++ NB Устаревшая версия алгоритмов < 3.2.44. Оставлена для совместимости.
	
	АдресКомпоновки = "";
	ТекстЗапроса = бит_МеханизмПолученияДанных.АдаптироватьТекстПостроителяДляКомпоновки(вхТекстЗапроса);
	
	ПредОтбор = Компоновщик.Настройки.Отбор.Элементы;
	
	Если НЕ ПустаяСтрока(ТекстЗапроса) Тогда
		
		// Создаем СКД по запросу.
		СКД = СоздатьСхемуКомпоновкиПоЗапросу(ТекстЗапроса);
		
		Если Найти(ТекстЗапроса, "&Бюджет") > 0 Тогда
			// Параметр Бюджет не должен быть доступен в настройках СКД.
			ПараметрСКД = СКД.Параметры.Добавить();
			ПараметрСКД.Имя                      = "Бюджет";
			ПараметрСКД.Заголовок                = "Бюджет";
			ПараметрСКД.ТипЗначения              = Новый ОписаниеТипов("СправочникСсылка.бит_Бюджеты");
			ПараметрСКД.ВключатьВДоступныеПоля   = Ложь;
			ПараметрСКД.ОграничениеИспользования = Истина;
			ПараметрСКД.Значение                 = Бюджет;
		КонецЕсли; 
		
		НастройкиИзмерений = бит_МеханизмДопИзмеренийПовтИсп.НастройкиДополнительныхИзмерений();
		бит_МеханизмДопИзмерений.СформироватьЗаголовкиПолейДополнительныхИзмеренийНастройкиФормыВвода(СКД, 
			"НаборДанныхОсновной",НастройкиИзмерений,,Ложь);	
		
		АдресКомпоновки = ПоместитьВоВременноеХранилище(СКД, УникальныйИдентификатор);
		
		КопияНастроек = Компоновщик.ПолучитьНастройки();

		// Инициализируем компоновщик.
		ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресКомпоновки);
		Попытка
			Компоновщик.Инициализировать(ИсточникНастроек);
		Исключение
			ТекстСообщения = НСтр("ru='Не удалось инициализировать компоновщик для отбора. Попробуйте обновить текст запроса. Описание ошибки: %1.';
								  |en='Failed to initialize builder for selection. Try refreshing the query text. Description of error: %1.'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
			ВызватьИсключение ТекстСообщения;
		КонецПопытки;
		
		Если ЗагрузитьНастройкиПоУмолчанию Тогда
			Компоновщик.ЗагрузитьНастройки(СКД.НастройкиПоУмолчанию);
			
			бит_ОтчетыБФКлиентСервер.СкопироватьЭлементы(Компоновщик.Настройки.Отбор, КопияНастроек.Отбор);
			бит_ОтчетыБФКлиентСервер.СкопироватьЭлементы(Компоновщик.Настройки.Порядок, КопияНастроек.Порядок);
			Компоновщик.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.Полное);
		КонецЕсли; 
	КонецЕсли; 
	
	Возврат АдресКомпоновки;
	
КонецФункции

// Процедура проверяет множественный разворот по статьям оборотов.
// 
// Параметры:
//  ТабЧастьИзмерения - ТабличнаяЧасть.
//  Отказ - Булево.
// 
Процедура ПроверитьМножественныйРазворотПоСтатьям(ТабЧастьИзмерения, Отказ, ВыводитьСообщения = Истина)  Экспорт
	
	// Проверка на двойной разворот по статьи.
	ИзмеренияБюдж     = бит_Бюджетирование.ПолучитьИзмеренияБюджетирования("все","имя");		
	КолРазворотСтатья = 0;
	Для каждого СтрокаТаблицы Из ТабЧастьИзмерения Цикл
		
		СтрИзмер = ИзмеренияБюдж[СтрокаТаблицы.Имя];
		
		Если СтрИзмер.Имя = "бит_СтатьиОборотов" 
		   И (СтрокаТаблицы.СпособЗаполнения = Перечисления.бит_СпособыЗаполненияИзмеренийВФормахВвода.Разворачивать
		 ИЛИ СтрокаТаблицы.СпособЗаполнения = Перечисления.бит_СпособыЗаполненияИзмеренийВФормахВвода.РазворачиватьСИерархией) Тогда
			
			КолРазворотСтатья = КолРазворотСтатья + 1;
		КонецЕсли; 
	КонецЦикла; 
	
	Если КолРазворотСтатья > 1 Тогда
		Если ВыводитьСообщения Тогда
			ТекстСообщения = НСтр("ru='Не допускается более одного разворота по Статьям оборотов.';
								  |en='It is not allowed more than one turn of the Articles of revolutions.'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		КонецЕсли; 
		Отказ = Истина;
	КонецЕсли; 		
	
КонецПроцедуры

Функция НастройкаСтруктурыБюджета(Измерения) Экспорт 
	
	// Таблица значений конвертируется в массив, т.к. данные настройки кэшируются
	// в форме документа ФВБ. Форма не поддерживает ТЗ в реквизитах.
							
	НастройкиИзмерений = Измерения.СкопироватьКолонки();
	Для каждого СтрокаТаблицы Из Измерения Цикл
		Если СтрокаТаблицы.СпособЗаполнения = Перечисления.бит_СпособыЗаполненияИзмеренийВФормахВвода.Разворачивать
		 ИЛИ СтрокаТаблицы.СпособЗаполнения = Перечисления.бит_СпособыЗаполненияИзмеренийВФормахВвода.РазворачиватьСИерархией Тогда
			ЗаполнитьЗначенияСвойств(НастройкиИзмерений.Добавить(), СтрокаТаблицы);		
		КонецЕсли;
	КонецЦикла;
	
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(НастройкиИзмерений);

КонецФункции

Функция НовыеЦветаОформления() Экспорт

	НовыеНастройки = Новый Структура;
	НовыеНастройки.Вставить("Цвет_Группа",   WebЦвета.Лимонный);
	НовыеНастройки.Вставить("Цвет_Ячейка",   WebЦвета.СветлоЗеленый);
	НовыеНастройки.Вставить("Цвет_Формула",  ЦветаСтиля.ДобавленныйРеквизитФон);
	НовыеНастройки.Вставить("Цвет_Аргумент", ЦветаСтиля.ЦветЛинииОтчета);
	
	Возврат НовыеНастройки;
	
КонецФункции

Функция СписокСмежности(НастройкиФормыВвода) Экспорт

	СписокСмежности = Новый Структура();
	
	Если ТипЗнч(НастройкиФормыВвода) = Тип("СправочникОбъект.бит_НастройкиФормВводаБюджета") Тогда
		Реквизит = НастройкиФормыВвода.ХранилищеСпискаСмежности;
	ИначеЕсли ЗначениеЗаполнено(НастройкиФормыВвода) Тогда	
		Реквизит = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НастройкиФормыВвода, "ХранилищеСпискаСмежности");
	КонецЕсли;
	
	Если ТипЗнч(Реквизит) = Тип("ХранилищеЗначения") Тогда
		СписокСмежности = Реквизит.Получить();
	КонецЕсли;

	Возврат СписокСмежности;
	
КонецФункции

Функция НоваяТаблицаИзмеренийНастройки(ЭтоВерсия_2)  Экспорт

	Образец = Метаданные.Справочники.бит_НастройкиФормВводаБюджета.ТабличныеЧасти.Измерения;
	
	Измерения = Новый ТаблицаЗначений;
	Для каждого Колонка Из Образец.Реквизиты Цикл
		Измерения.Колонки.Добавить(Колонка.Имя, Колонка.Тип);	
	КонецЦикла;
	
	ИзмеренияБюджетирования = бит_Бюджетирование.ПолучитьИзмеренияБюджетирования("Все", "Тип", "Структура");
	НастройкиИзмерений		= бит_Бюджетирование.НастройкиИзмеренийБюджетирования();
	ПерваяГруппировка 		= Истина;
	
	Для каждого КиЗ Из ИзмеренияБюджетирования Цикл
		
		Настройка = НастройкиИзмерений[КиЗ.Ключ];
		Если Настройка = Неопределено Тогда
			Продолжить;		
		КонецЕсли;	
		
		НоваяСтрока						= Измерения.Добавить();
	    НоваяСтрока.Имя					= КиЗ.Ключ;
		НоваяСтрока.ЗначениеПоУмолчанию = КиЗ.Значение.ПривестиЗначение(НоваяСтрока.ЗначениеПоУмолчанию);
		
		СпособЗаполнения = СпособЗаполненияПоУмолчанию(НоваяСтрока.Имя);
		Если СпособЗаполнения = Перечисления.бит_СпособыЗаполненияИзмеренийВФормахВвода.Разворачивать И ЭтоВерсия_2 Тогда
			Если ПерваяГруппировка Тогда
				СпособЗаполнения  = Перечисления.бит_СпособыЗаполненияИзмеренийВФормахВвода.РазворачиватьСИерархией;
				ПерваяГруппировка = Ложь;
			КонецЕсли;
		КонецЕсли;
		НоваяСтрока.СпособЗаполнения = СпособЗаполнения;
	КонецЦикла; 

	Возврат Измерения;
	
КонецФункции

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

Функция ДанныеСправочника(Настройка)	
	
	ДанныеСправочника = Новый Структура; 
	
	Для каждого Реквизит Из Метаданные.Справочники.бит_НастройкиФормВводаБюджета.Реквизиты Цикл
		ДанныеСправочника.Вставить(Реквизит.Имя, Реквизит.Тип.ПривестиЗначение());
	КонецЦикла;
	
	ДанныеСправочника.Вставить("Измерения", 		  Новый ТаблицаЗначений);
	ДанныеСправочника.Вставить("ДополнительныеИтоги", Новый ТаблицаЗначений);
		
	Если ТипЗнч(Настройка) = Тип("СправочникСсылка.бит_НастройкиФормВводаБюджета") И ЗначениеЗаполнено(Настройка) Тогда 
		Свойства 		  = ОбщегоНазначенияКлиентСервер.КлючиСтруктурыВСтроку(ДанныеСправочника, ",");
		ДанныеСправочника = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Настройка, Свойства);  
		ДанныеСправочника.Измерения			  = ДанныеСправочника.Измерения.Выгрузить();
		ДанныеСправочника.ДополнительныеИтоги = ДанныеСправочника.ДополнительныеИтоги.Выгрузить();
	Иначе	
		ЗаполнитьЗначенияСвойств(ДанныеСправочника, Настройка);  
		ДанныеСправочника.Измерения			  = Настройка.Измерения.Выгрузить();
		ДанныеСправочника.ДополнительныеИтоги = Настройка.ДополнительныеИтоги.Выгрузить();
	КонецЕсли;	
	
	ДанныеСправочника.Измерения.Сортировать("НомерСтроки");
	ДанныеСправочника.ДополнительныеИтоги.Сортировать("НомерСтроки");
	
	ДанныеСправочника.Вставить("Настройка", Настройка);
		
	Результат = Новый Структура; 
	Результат.Вставить("Реквизиты", 	   ДанныеСправочника);
	Результат.Вставить("ТаблицаИзмерения", ДанныеСправочника.Измерения);
	Результат.Вставить("ТаблицаДопИтоги",  ДанныеСправочника.ДополнительныеИтоги);
	
    Возврат  Результат;
	
КонецФункции

// Функция создает схему компоновки данных по тексту запроса.
// 
// Параметры:
// ТекстЗапроса - Строка
// ИмяНабораДанных - Строка
// 
// Возвращаемое значение:
//  СКД - СхемаКомпоновкиДанных.
// 
Функция СоздатьСхемуКомпоновкиПоЗапросу(ТекстЗапроса)
	
	// ++ NB Устаревшая версия алгоритмов < 3.2.44. Оставлена для совместимости.
	
	СКД = бит_МеханизмПолученияДанных.СоздатьСхемуКомпоновкиПоЗапросу(ТекстЗапроса, "НаборДанныхОсновной");
	ПолеСсылка = СКД.НаборыДанных["НаборДанныхОсновной"].Поля.Найти("Ссылка");
	Если ПолеСсылка <> Неопределено Тогда
		ПолеСсылка.Заголовок = НСтр("ru = 'Измерение'");
	КонецЕсли;
	
	Возврат СКД
	
КонецФункции

// Функция-конструктор структуры, описывающий измерение в форме ввода.
// 
// Параметры:
// Имя - Строка
// Синоним - Строка
// СпособЗаполнения - ПеречислениеСсылка.бит_СпособыЗаполненияИзмеренийВФормахВвода
// ЗначениеПоУмолчанию - Произвольный.
// 
// Возвращаемое значение:
//  РезСтруктура - Структура.
// 
Функция ОписаниеИзмерения(Имя, Синоним, СпособЗаполнения, ЗначениеПоУмолчанию)

	Результат = Новый Структура; 
	Результат.Вставить("ИмяКласса", 		 "НастройкаИзмеренияФормыВводаБюджета");
	Результат.Вставить("Имя",				 Имя);
	Результат.Вставить("Синоним", 			 Синоним);
	Результат.Вставить("СпособЗаполнения",	 СпособЗаполнения);
	Результат.Вставить("ЗначениеПоУмолчанию",ЗначениеПоУмолчанию);
	
	Возврат Результат;
	
КонецФункции

Функция СпособЗаполненияПоУмолчанию(ИмяИзмерения)
	
	СпособЗаполнения = Перечисления.бит_СпособыЗаполненияИзмеренийВФормахВвода.РучнойВвод;
	Если ИмяИзмерения = "Сценарий" Тогда
		СпособЗаполнения = Перечисления.бит_СпособыЗаполненияИзмеренийВФормахВвода.ПоУмолчанию;
	ИначеЕсли ИмяИзмерения = "ЦФО" Тогда
		СпособЗаполнения = Перечисления.бит_СпособыЗаполненияИзмеренийВФормахВвода.ПоУмолчанию;	
	ИначеЕсли ИмяИзмерения = "СтатьяОборотов" Тогда
		СпособЗаполнения = Перечисления.бит_СпособыЗаполненияИзмеренийВФормахВвода.Разворачивать;
	ИначеЕсли ИмяИзмерения = "Организация" Тогда
		СпособЗаполнения = Перечисления.бит_СпособыЗаполненияИзмеренийВФормахВвода.ПоУмолчанию;	
	Иначе		
		СпособЗаполнения = Перечисления.бит_СпособыЗаполненияИзмеренийВФормахВвода.РучнойВвод;
	КонецЕсли; 
	
	Возврат СпособЗаполнения;
	
КонецФункции

#КонецОбласти

#КонецЕсли
